# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний
# и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

list1 = [2, 3, 4, 5, 5, 6]
res = []
while list1:
    res.append(list1[0] * list1[-1])
    list1.pop(0)
    list1.pop(-1)
    if len(list1) == 1:
        res.append(list1[0] * list1[0])
        list1.pop(0)
print(res)
